; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite1 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite2 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite3 - satellite
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	infrared1 - mode
	image3 - mode
	spectrograph0 - mode
	image4 - mode
	image2 - mode
	GroundStation2 - direction
	Star8 - direction
	Star17 - direction
	Star18 - direction
	GroundStation28 - direction
	Star30 - direction
	GroundStation1 - direction
	Star14 - direction
	Star12 - direction
	Star13 - direction
	GroundStation21 - direction
	GroundStation20 - direction
	GroundStation22 - direction
	Star26 - direction
	GroundStation38 - direction
	GroundStation11 - direction
	Star37 - direction
	Star7 - direction
	Star24 - direction
	Star6 - direction
	GroundStation35 - direction
	GroundStation23 - direction
	Star0 - direction
	Star5 - direction
	GroundStation4 - direction
	GroundStation33 - direction
	Star3 - direction
	GroundStation31 - direction
	Star29 - direction
	GroundStation10 - direction
	GroundStation34 - direction
	GroundStation25 - direction
	GroundStation39 - direction
	GroundStation27 - direction
	Star15 - direction
	GroundStation16 - direction
	GroundStation32 - direction
	GroundStation19 - direction
	GroundStation9 - direction
	Star36 - direction
	Star40 - direction
	Phenomenon41 - direction
	Phenomenon42 - direction
	Planet43 - direction
	Planet44 - direction
	Phenomenon45 - direction
	Phenomenon46 - direction
	Planet47 - direction
	Star48 - direction
	Phenomenon49 - direction
	Star50 - direction
	Planet51 - direction
	Phenomenon52 - direction
	Phenomenon53 - direction
	Star54 - direction
	Star55 - direction
	Planet56 - direction
	Phenomenon57 - direction
	Star58 - direction
	Phenomenon59 - direction
	Planet60 - direction
	Star61 - direction
	Phenomenon62 - direction
	Planet63 - direction
	Star64 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 image2)
	(calibration_target instrument0 Star37)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 Star14)
	(calibration_target instrument0 GroundStation10)
	(calibration_target instrument0 Star13)
	(calibration_target instrument0 Star26)
	(calibration_target instrument0 Star7)
	(calibration_target instrument0 GroundStation35)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 GroundStation31)
	(supports instrument1 image2)
	(calibration_target instrument1 Star36)
	(calibration_target instrument1 Star12)
	(calibration_target instrument1 GroundStation31)
	(calibration_target instrument1 GroundStation33)
	(calibration_target instrument1 GroundStation32)
	(calibration_target instrument1 Star24)
	(calibration_target instrument1 GroundStation11)
	(calibration_target instrument1 GroundStation20)
	(calibration_target instrument1 GroundStation23)
	(supports instrument2 spectrograph0)
	(supports instrument2 infrared1)
	(calibration_target instrument2 GroundStation16)
	(calibration_target instrument2 Star0)
	(calibration_target instrument2 Star12)
	(calibration_target instrument2 Star15)
	(supports instrument3 spectrograph0)
	(supports instrument3 image3)
	(calibration_target instrument3 Star13)
	(calibration_target instrument3 Star6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation33)
	(supports instrument4 image4)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 GroundStation20)
	(calibration_target instrument4 GroundStation21)
	(calibration_target instrument4 GroundStation4)
	(calibration_target instrument4 Star6)
	(calibration_target instrument4 GroundStation39)
	(supports instrument5 image3)
	(supports instrument5 image2)
	(supports instrument5 image4)
	(calibration_target instrument5 GroundStation22)
	(supports instrument6 image3)
	(calibration_target instrument6 Star24)
	(calibration_target instrument6 Star6)
	(calibration_target instrument6 Star26)
	(calibration_target instrument6 GroundStation16)
	(calibration_target instrument6 GroundStation32)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(on_board instrument6 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation4)
	(supports instrument7 image2)
	(supports instrument7 image3)
	(supports instrument7 spectrograph0)
	(calibration_target instrument7 Star37)
	(calibration_target instrument7 GroundStation11)
	(calibration_target instrument7 GroundStation23)
	(calibration_target instrument7 GroundStation33)
	(calibration_target instrument7 GroundStation4)
	(calibration_target instrument7 Star3)
	(calibration_target instrument7 Star0)
	(calibration_target instrument7 GroundStation31)
	(calibration_target instrument7 GroundStation38)
	(supports instrument8 infrared1)
	(supports instrument8 image4)
	(supports instrument8 image3)
	(calibration_target instrument8 GroundStation23)
	(calibration_target instrument8 GroundStation35)
	(calibration_target instrument8 GroundStation10)
	(calibration_target instrument8 Star6)
	(calibration_target instrument8 Star5)
	(calibration_target instrument8 GroundStation34)
	(calibration_target instrument8 GroundStation25)
	(calibration_target instrument8 GroundStation16)
	(calibration_target instrument8 Star0)
	(calibration_target instrument8 Star24)
	(calibration_target instrument8 GroundStation27)
	(calibration_target instrument8 Star7)
	(supports instrument9 infrared1)
	(calibration_target instrument9 Star36)
	(calibration_target instrument9 GroundStation10)
	(calibration_target instrument9 Star29)
	(calibration_target instrument9 GroundStation19)
	(calibration_target instrument9 GroundStation34)
	(calibration_target instrument9 GroundStation31)
	(calibration_target instrument9 Star3)
	(calibration_target instrument9 GroundStation33)
	(calibration_target instrument9 GroundStation4)
	(calibration_target instrument9 Star5)
	(calibration_target instrument9 Star0)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(on_board instrument9 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon62)
	(supports instrument10 infrared1)
	(supports instrument10 image4)
	(calibration_target instrument10 GroundStation9)
	(calibration_target instrument10 Star36)
	(calibration_target instrument10 GroundStation39)
	(calibration_target instrument10 GroundStation25)
	(calibration_target instrument10 GroundStation27)
	(calibration_target instrument10 GroundStation34)
	(supports instrument11 image2)
	(calibration_target instrument11 GroundStation19)
	(calibration_target instrument11 GroundStation32)
	(calibration_target instrument11 GroundStation16)
	(calibration_target instrument11 Star15)
	(calibration_target instrument11 GroundStation27)
	(supports instrument12 image3)
	(supports instrument12 image4)
	(supports instrument12 image2)
	(calibration_target instrument12 Star36)
	(calibration_target instrument12 GroundStation9)
	(on_board instrument10 satellite3)
	(on_board instrument11 satellite3)
	(on_board instrument12 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star40)
)
(:goal (and
	(have_image Star40 image2)
	(have_image Phenomenon41 image2)
	(have_image Phenomenon42 infrared1)
	(have_image Planet43 image3)
	(have_image Planet44 infrared1)
	(have_image Phenomenon45 image2)
	(have_image Phenomenon46 image3)
	(have_image Planet47 image4)
	(have_image Star48 image2)
	(have_image Phenomenon49 image4)
	(have_image Star50 image3)
	(have_image Planet51 image4)
	(have_image Phenomenon52 spectrograph0)
	(have_image Phenomenon53 infrared1)
	(have_image Star54 image2)
	(have_image Star55 image2)
	(have_image Planet56 image3)
	(have_image Phenomenon57 image4)
	(have_image Star58 infrared1)
	(have_image Phenomenon59 spectrograph0)
	(have_image Planet60 infrared1)
	(have_image Star61 image2)
	(have_image Phenomenon62 infrared1)
	(have_image Planet63 image3)
	(have_image Star64 image3)
))

)

; plan
1. (switch_on instrument10 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument10)
   goals met: 0 of 25
2. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 25
3. (calibrate satellite1 instrument4 groundstation4)
   added: (calibrated instrument4)
   goals met: 0 of 25
4. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 25
5. (switch_on instrument7 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument7)
   goals met: 0 of 25
6. (calibrate satellite0 instrument1 groundstation33)
   added: (calibrated instrument1)
   goals met: 0 of 25
7. (turn_to satellite3 phenomenon42 star40)
   deleted: (pointing satellite3 star40)
   added: (pointing satellite3 phenomenon42)
   goals met: 0 of 25
8. (turn_to satellite2 phenomenon46 phenomenon62)
   deleted: (pointing satellite2 phenomenon62)
   added: (pointing satellite2 phenomenon46)
   goals met: 0 of 25
9. (turn_to satellite1 phenomenon49 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 phenomenon49)
   goals met: 0 of 25
10. (take_image satellite1 phenomenon49 instrument4 image4)
   added: (have_image phenomenon49 image4)
   goals met: 1 of 25
11. (turn_to satellite1 phenomenon52 phenomenon49)
   deleted: (pointing satellite1 phenomenon49)
   added: (pointing satellite1 phenomenon52)
   goals met: 1 of 25
12. (take_image satellite1 phenomenon52 instrument4 spectrograph0)
   added: (have_image phenomenon52 spectrograph0)
   goals met: 2 of 25
13. (turn_to satellite1 phenomenon57 phenomenon52)
   deleted: (pointing satellite1 phenomenon52)
   added: (pointing satellite1 phenomenon57)
   goals met: 2 of 25
14. (take_image satellite1 phenomenon57 instrument4 image4)
   added: (have_image phenomenon57 image4)
   goals met: 3 of 25
15. (turn_to satellite1 phenomenon59 phenomenon57)
   deleted: (pointing satellite1 phenomenon57)
   added: (pointing satellite1 phenomenon59)
   goals met: 3 of 25
16. (take_image satellite1 phenomenon59 instrument4 spectrograph0)
   added: (have_image phenomenon59 spectrograph0)
   goals met: 4 of 25
17. (turn_to satellite1 planet47 phenomenon59)
   deleted: (pointing satellite1 phenomenon59)
   added: (pointing satellite1 planet47)
   goals met: 4 of 25
18. (take_image satellite1 planet47 instrument4 image4)
   added: (have_image planet47 image4)
   goals met: 5 of 25
19. (turn_to satellite1 planet51 planet47)
   deleted: (pointing satellite1 planet47)
   added: (pointing satellite1 planet51)
   goals met: 5 of 25
20. (take_image satellite1 planet51 instrument4 image4)
   added: (have_image planet51 image4)
   goals met: 6 of 25
21. (turn_to satellite0 phenomenon41 groundstation33)
   deleted: (pointing satellite0 groundstation33)
   added: (pointing satellite0 phenomenon41)
   goals met: 6 of 25
22. (take_image satellite0 phenomenon41 instrument1 image2)
   added: (have_image phenomenon41 image2)
   goals met: 7 of 25
23. (turn_to satellite0 phenomenon45 phenomenon41)
   deleted: (pointing satellite0 phenomenon41)
   added: (pointing satellite0 phenomenon45)
   goals met: 7 of 25
24. (take_image satellite0 phenomenon45 instrument1 image2)
   added: (have_image phenomenon45 image2)
   goals met: 8 of 25
25. (turn_to satellite0 star40 phenomenon45)
   deleted: (pointing satellite0 phenomenon45)
   added: (pointing satellite0 star40)
   goals met: 8 of 25
26. (take_image satellite0 star40 instrument1 image2)
   added: (have_image star40 image2)
   goals met: 9 of 25
27. (turn_to satellite0 star48 star40)
   deleted: (pointing satellite0 star40)
   added: (pointing satellite0 star48)
   goals met: 9 of 25
28. (take_image satellite0 star48 instrument1 image2)
   added: (have_image star48 image2)
   goals met: 10 of 25
29. (turn_to satellite0 star54 star48)
   deleted: (pointing satellite0 star48)
   added: (pointing satellite0 star54)
   goals met: 10 of 25
30. (take_image satellite0 star54 instrument1 image2)
   added: (have_image star54 image2)
   goals met: 11 of 25
31. (turn_to satellite0 star55 star54)
   deleted: (pointing satellite0 star54)
   added: (pointing satellite0 star55)
   goals met: 11 of 25
32. (take_image satellite0 star55 instrument1 image2)
   added: (have_image star55 image2)
   goals met: 12 of 25
33. (turn_to satellite0 star61 star55)
   deleted: (pointing satellite0 star55)
   added: (pointing satellite0 star61)
   goals met: 12 of 25
34. (take_image satellite0 star61 instrument1 image2)
   added: (have_image star61 image2)
   goals met: 13 of 25
35. (turn_to satellite3 star36 phenomenon42)
   deleted: (pointing satellite3 phenomenon42)
   added: (pointing satellite3 star36)
   goals met: 13 of 25
36. (calibrate satellite3 instrument10 star36)
   added: (calibrated instrument10)
   goals met: 13 of 25
37. (turn_to satellite3 phenomenon42 star36)
   deleted: (pointing satellite3 star36)
   added: (pointing satellite3 phenomenon42)
   goals met: 13 of 25
38. (take_image satellite3 phenomenon42 instrument10 infrared1)
   added: (have_image phenomenon42 infrared1)
   goals met: 14 of 25
39. (turn_to satellite3 phenomenon53 phenomenon42)
   deleted: (pointing satellite3 phenomenon42)
   added: (pointing satellite3 phenomenon53)
   goals met: 14 of 25
40. (take_image satellite3 phenomenon53 instrument10 infrared1)
   added: (have_image phenomenon53 infrared1)
   goals met: 15 of 25
41. (turn_to satellite3 phenomenon62 phenomenon53)
   deleted: (pointing satellite3 phenomenon53)
   added: (pointing satellite3 phenomenon62)
   goals met: 15 of 25
42. (take_image satellite3 phenomenon62 instrument10 infrared1)
   added: (have_image phenomenon62 infrared1)
   goals met: 16 of 25
43. (turn_to satellite3 planet44 phenomenon62)
   deleted: (pointing satellite3 phenomenon62)
   added: (pointing satellite3 planet44)
   goals met: 16 of 25
44. (take_image satellite3 planet44 instrument10 infrared1)
   added: (have_image planet44 infrared1)
   goals met: 17 of 25
45. (turn_to satellite3 planet60 planet44)
   deleted: (pointing satellite3 planet44)
   added: (pointing satellite3 planet60)
   goals met: 17 of 25
46. (take_image satellite3 planet60 instrument10 infrared1)
   added: (have_image planet60 infrared1)
   goals met: 18 of 25
47. (turn_to satellite3 star58 planet60)
   deleted: (pointing satellite3 planet60)
   added: (pointing satellite3 star58)
   goals met: 18 of 25
48. (take_image satellite3 star58 instrument10 infrared1)
   added: (have_image star58 infrared1)
   goals met: 19 of 25
49. (turn_to satellite2 star37 phenomenon46)
   deleted: (pointing satellite2 phenomenon46)
   added: (pointing satellite2 star37)
   goals met: 19 of 25
50. (calibrate satellite2 instrument7 star37)
   added: (calibrated instrument7)
   goals met: 19 of 25
51. (turn_to satellite2 phenomenon46 star37)
   deleted: (pointing satellite2 star37)
   added: (pointing satellite2 phenomenon46)
   goals met: 19 of 25
52. (take_image satellite2 phenomenon46 instrument7 image3)
   added: (have_image phenomenon46 image3)
   goals met: 20 of 25
53. (turn_to satellite2 planet43 phenomenon46)
   deleted: (pointing satellite2 phenomenon46)
   added: (pointing satellite2 planet43)
   goals met: 20 of 25
54. (take_image satellite2 planet43 instrument7 image3)
   added: (have_image planet43 image3)
   goals met: 21 of 25
55. (turn_to satellite2 planet56 planet43)
   deleted: (pointing satellite2 planet43)
   added: (pointing satellite2 planet56)
   goals met: 21 of 25
56. (take_image satellite2 planet56 instrument7 image3)
   added: (have_image planet56 image3)
   goals met: 22 of 25
57. (turn_to satellite2 planet63 planet56)
   deleted: (pointing satellite2 planet56)
   added: (pointing satellite2 planet63)
   goals met: 22 of 25
58. (take_image satellite2 planet63 instrument7 image3)
   added: (have_image planet63 image3)
   goals met: 23 of 25
59. (turn_to satellite2 star50 planet63)
   deleted: (pointing satellite2 planet63)
   added: (pointing satellite2 star50)
   goals met: 23 of 25
60. (take_image satellite2 star50 instrument7 image3)
   added: (have_image star50 image3)
   goals met: 24 of 25
61. (turn_to satellite2 star64 star50)
   deleted: (pointing satellite2 star50)
   added: (pointing satellite2 star64)
   goals met: 24 of 25
62. (take_image satellite2 star64 instrument7 image3)
   added: (have_image star64 image3)
   goals met: 25 of 25
